Revit 2016 API
Family.GetFamilyTypeParameterValues Method
 Returns all applicable values for a FamilyType parameter of this family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2016
Syntax
C#
public ISet<ElementId> GetFamilyTypeParameterValues(
	ElementId parameterId
)
Visual Basic
Public Function GetFamilyTypeParameterValues ( _
	parameterId As ElementId _
) As ISet(Of ElementId)
Visual C++
public:
ISet<ElementId^>^ GetFamilyTypeParameterValues(
	ElementId^ parameterId
)
Parameters
parameterId
Type: Autodesk.Revit.DB.ElementId
 A valid Id of a FamilyType parameter defined for this family.
Return Value
 Ids of all applicable ElementType and [!:NestedFamilyTypeReference] elements.
Remarks
The values are Element Ids of all family types that match the category specified by the definition of the given parameter. The elements are either of class ElementType or [!:NestedFamilyTypeReference]. The second variant is for the types that are nested in families and thus are not accessible otherwise.
If there are no applicable types of such category the returned collection will be empty.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The given parameterId does not represent a valid FamilyType parameter of this family.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
Family Class
Autodesk.Revit.DB Namespace